In [1]:
%pip install ipython
%pip install seaborn

Requirement already satisfied: ipython in c:\users\david\anaconda3\envs\clase\lib\site-packages (7.34.0)
Requirement already satisfied: backcall in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (0.2.0)
Requirement already satisfied: matplotlib-inline in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (0.1.6)
Requirement already satisfied: pygments in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (2.13.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (63.4.1)
Requirement already satisfied: jedi>=0.16 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (0.18.1)
Requirement already satisfied: pickleshare in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (0.7.5)
Requirement already satisfied: colorama in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (0.4.5)
Requirement already satisfied: traitlets>=4.2 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (5.4.0)
Requirement already satisfied: decorator in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (5.1.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from ipython) (3.0.31)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from jedi>=0.16->ipython) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\david\anaconda3\envs\clase\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython) (0.2.5)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in c:\users\david\anaconda3\envs\clase\lib\site-packages (0.12.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.1 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from seaborn) (3.5.3)
Requirement already satisfied: pandas>=0.25 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from seaborn) (1.3.5)
Requirement already satisfied: numpy>=1.17 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from seaborn) (1.21.6)
Requirement already satisfied: typing_extensions in c:\users\david\anaconda3\envs\clase\lib\site-packages (from seaborn) (4.4.0)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (4.38.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.4.4)
Requirement already satisfied: cycler>=0.10 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (0.11.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: pillow>=6.2.0 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (9.2.0)
Requirement already satisfied: packaging>=20.0 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (21.3)
Requirement already satisfied: pytz>=2017.3 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from pandas>=0.25->seaborn) (2022.4)
Requirement already satisfied: six>=1.5 in c:\users\david\anaconda3\envs\clase\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
# importación de librerías
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# para pintar
import pylab as plt
import seaborn as sns

#para que salga el grafico
%matplotlib inline

In [3]:
# importación de csv
df_act_ori = pd.read_csv(r'C:\Users\david\Proyectos\w3-database-project\data\actor.csv')

In [4]:
df_act_ori.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [5]:
df_act=df_act_ori.copy()

In [6]:
df_act.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [7]:
df_act.shape

(200, 4)

In [8]:
df_act_dim_orig=df_act.shape

In [9]:
df_act.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [10]:
nan_cols=df_act.isna().sum()

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [11]:
df_act.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
actor_id,200.0,NaN,NaN,NaN,100.5,57.879185,1.0,50.75,100.5,150.25,200.0
first_name,200,128,PENELOPE,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last_name,200,121,KILMER,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last_update,200,1,2006-02-15 04:34:33,200,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
df_act.columns

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')

In [13]:
df_act.drop_duplicates().shape==df_act.shape

True

In [14]:
# exploración columna 'actor_id'
df_act.actor_id.head()

0    1
1    2
2    3
3    4
4    5
Name: actor_id, dtype: int64

In [17]:
df_act.actor_id.unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200], dtype=int64)

In [18]:
df_act.actor_id.value_counts()

1      1
138    1
128    1
129    1
130    1
131    1
132    1
133    1
134    1
135    1
136    1
137    1
139    1
2      1
140    1
141    1
142    1
143    1
144    1
145    1
146    1
147    1
148    1
149    1
127    1
126    1
125    1
124    1
103    1
104    1
105    1
106    1
107    1
108    1
109    1
110    1
111    1
112    1
113    1
114    1
115    1
116    1
117    1
118    1
119    1
120    1
121    1
122    1
123    1
150    1
151    1
152    1
177    1
179    1
180    1
181    1
182    1
183    1
184    1
185    1
186    1
187    1
188    1
189    1
190    1
191    1
192    1
193    1
194    1
195    1
196    1
197    1
198    1
199    1
178    1
176    1
153    1
175    1
154    1
155    1
156    1
157    1
158    1
159    1
160    1
161    1
162    1
163    1
164    1
165    1
166    1
167    1
168    1
169    1
170    1
171    1
172    1
173    1
174    1
102    1
101    1
100    1
26     1
28     1
29     1
30     1
31     1
32     1
33     1
34     1
35     1
36     1
37     1
38     1
39     1
40     1
41     1
42     1
43     1
44     1
45     1
46     1
47     1
48     1
27     1
25     1
50     1
24     1
3      1
4      1
5      1
6      1
7      1
8      1
9      1
10     1
11     1
12     1
13     1
14     1
15     1
16     1
17     1
18     1
19     1
20     1
21     1
22     1
23     1
49     1
51     1
99     1
76     1
78     1
79     1
80     1
81     1
82     1
83     1
84     1
85     1
86     1
87     1
88     1
89     1
90     1
91     1
92     1
93     1
94     1
95     1
96     1
97     1
98     1
77     1
75     1
52     1
74     1
53     1
54     1
55     1
56     1
57     1
58     1
59     1
60     1
61     1
62     1
63     1
64     1
65     1
66     1
67     1
68     1
69     1
70     1
71     1
72     1
73     1
200    1
Name: actor_id, dtype: int64

In [19]:
len(df_act.actor_id.value_counts())

200

In [20]:
df_act.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [21]:
# exploración columna 'actor_id'
len(df_act.first_name.unique())

128

In [22]:
df_act.first_name.value_counts()

PENELOPE       4
JULIA          4
KENNETH        4
GENE           3
GROUCHO        3
DAN            3
CUBA           3
JAYNE          3
CAMERON        3
FAY            3
CHRISTIAN      3
MATTHEW        3
BURT           3
MORGAN         3
RUSSELL        3
ED             3
NICK           3
MENA           2
ANGELA         2
MARY           2
GARY           2
ADAM           2
SEAN           2
CATE           2
GRETA          2
SCARLETT       2
BEN            2
REESE          2
MINNIE         2
ALBERT         2
SPENCER        2
CHRISTOPHER    2
DARYL          2
CHRIS          2
RENEE          2
SUSAN          2
MERYL          2
FRANCES        2
WARREN         2
AUDREY         2
KEVIN          2
LUCILLE        2
MICHAEL        2
RIP            2
WOODY          2
VIVIEN         2
MILLA          2
KIRSTEN        2
SANDRA         2
HUMPHREY       2
TOM            2
JOHNNY         2
LIZA           1
DEBBIE         1
ROCK           1
GREGORY        1
SALMA          1
LISA           1
JULIANNE       1
JON            1
WILLIAM        1
JOHN           1
HARRISON       1
BELA           1
JEFF           1
HARVEY         1
ALAN           1
RIVER          1
OPRAH          1
IAN            1
SYLVESTER      1
GEOFFREY       1
EMILY          1
AL             1
KIM            1
JADA           1
JANE           1
WHOOPI         1
LAURENCE       1
WILL           1
EWAN           1
OLYMPIA        1
RITA           1
LAURA          1
RICHARD        1
MAE            1
GINA           1
BOB            1
JODIE          1
GOLDIE         1
VAL            1
JUDY           1
TIM            1
SISSY          1
ALEC           1
ELVIS          1
HELEN          1
SIDNEY         1
FRED           1
UMA            1
KARL           1
ZERO           1
JOE            1
GRACE          1
BETTE          1
JENNIFER       1
KIRK           1
PARKER         1
ANNE           1
NATALIE        1
WALTER         1
JIM            1
MEG            1
ELLEN          1
CHARLIZE       1
GREG           1
JAMES          1
RALPH          1
CARY           1
ANGELINA       1
MICHELLE       1
JESSICA        1
RAY            1
HENRY          1
DUSTIN         1
JUDE           1
CARMEN         1
THORA          1
Name: first_name, dtype: int64

In [23]:
len(df_act.last_name.unique())

121

In [24]:
df_act.last_name.value_counts().head()

KILMER     5
TEMPLE     4
NOLTE      4
GUINESS    3
ALLEN      3
Name: last_name, dtype: int64

In [25]:
df_act.drop_duplicates(subset = ['first_name','last_name']).shape==df_act.shape

False

In [26]:
df_act[(df_act.first_name == df_act.last_name)].head()

Empty DataFrame
Columns: [actor_id, first_name, last_name, last_update]
Index: []

In [27]:
df_act['complete_name'] = df_act.first_name + (' ') + df_act.last_name

In [28]:
df_act['complete_name']

0          PENELOPE GUINESS
1             NICK WAHLBERG
2                  ED CHASE
3            JENNIFER DAVIS
4       JOHNNY LOLLOBRIGIDA
5           BETTE NICHOLSON
6              GRACE MOSTEL
7         MATTHEW JOHANSSON
8                 JOE SWANK
9           CHRISTIAN GABLE
10                ZERO CAGE
11               KARL BERRY
12                 UMA WOOD
13            VIVIEN BERGEN
14             CUBA OLIVIER
15             FRED COSTNER
16             HELEN VOIGHT
17                 DAN TORN
18              BOB FAWCETT
19            LUCILLE TRACY
20          KIRSTEN PALTROW
21               ELVIS MARX
22            SANDRA KILMER
23           CAMERON STREEP
24              KEVIN BLOOM
25             RIP CRAWFORD
26            JULIA MCQUEEN
27            WOODY HOFFMAN
28               ALEC WAYNE
29              SANDRA PECK
30           SISSY SOBIESKI
31              TIM HACKMAN
32               MILLA PECK
33           AUDREY OLIVIER
34                JUDY DEAN
35             BURT DUKAKIS
36               VAL BOLGER
37             TOM MCKELLEN
38             GOLDIE BRODY
39              JOHNNY CAGE
40          JODIE DEGENERES
41              TOM MIRANDA
42            KIRK JOVOVICH
43            NICK STALLONE
44             REESE KILMER
45          PARKER GOLDBERG
46          JULIA BARRYMORE
47        FRANCES DAY-LEWIS
48              ANNE CRONYN
49          NATALIE HOPKINS
50             GARY PHOENIX
51              CARMEN HUNT
52              MENA TEMPLE
53         PENELOPE PINKETT
54               FAY KILMER
55               DAN HARRIS
56              JUDE CRUISE
57         CHRISTIAN AKROYD
58            DUSTIN TAUTOU
59              HENRY BERRY
60         CHRISTIAN NEESON
61             JAYNE NEESON
62             CAMERON WRAY
63            RAY JOHANSSON
64            ANGELA HUDSON
65               MARY TANDY
66           JESSICA BAILEY
67              RIP WINSLET
68          KENNETH PALTROW
69     MICHELLE MCCONAUGHEY
70               ADAM GRANT
71            SEAN WILLIAMS
72                GARY PENN
73             MILLA KEITEL
74               BURT POSEY
75         ANGELINA ASTAIRE
76         CARY MCCONAUGHEY
77          GROUCHO SINATRA
78              MAE HOFFMAN
79               RALPH CRUZ
80           SCARLETT DAMON
81              WOODY JOLIE
82               BEN WILLIS
83               JAMES PITT
84         MINNIE ZELLWEGER
85             GREG CHAPLIN
86             SPENCER PECK
87            KENNETH PESCI
88           CHARLIZE DENCH
89             SEAN GUINESS
90        CHRISTOPHER BERRY
91           KIRSTEN AKROYD
92            ELLEN PRESLEY
93             KENNETH TORN
94           DARYL WAHLBERG
95              GENE WILLIS
96                MEG HAWKE
97            CHRIS BRIDGES
98               JIM MOSTEL
99             SPENCER DEPP
100             SUSAN DAVIS
101             WALTER TORN
102           MATTHEW LEIGH
103         PENELOPE CRONYN
104            SIDNEY CROWE
105           GROUCHO DUNST
106          GINA DEGENERES
107            WARREN NOLTE
108          SYLVESTER DERN
109             SUSAN DAVIS
110       CAMERON ZELLWEGER
111          RUSSELL BACALL
112          MORGAN HOPKINS
113        MORGAN MCDORMAND
114           HARRISON BALE
115              DAN STREEP
116             RENEE TRACY
117              CUBA ALLEN
118          WARREN JACKMAN
119         PENELOPE MONROE
120            LIZA BERGMAN
121             SALMA NOLTE
122          JULIANNE DENCH
123         SCARLETT BENING
124            ALBERT NOLTE
125           FRANCES TOMEI
126           KEVIN GARLAND
127            CATE MCQUEEN
128          DARYL CRAWFORD
129            GRETA KEITEL
130            JANE JACKMAN
131             ADAM HOPPER
132            RICHARD PENN
133            GENE HOPKINS
134           RITA REYNOLDS
135            ED MANSFIELD
136         MORGAN WILLIAMS
137             LUCILLE DEE
138            EWAN GOODING
139             WHOOPI HURT
140             CATE HARRIS
141              JADA RYDER
142              RIVER DEAN
143      ANGELA WITHERSPOON
144               KIM ALLEN
145        ALBERT JOHANSSON
146             FAY WINSLET
147               EMILY DEE
148          RUSSELL TEMPLE
149             JAYNE NOLTE
150         GEOFFREY HESTON
151              BEN HARRIS
152           MINNIE KILMER
153            MERYL GIBSON
154               IAN TANDY
155                FAY WOOD
156            GRETA MALDEN
157         VIVIEN BASINGER
158             LAURA BRODY
159              CHRIS DEPP
160             HARVEY HOPE
161            OPRAH KILMER
162        CHRISTOPHER WEST
163         HUMPHREY WILLIS
164              AL GARLAND
165          NICK DEGENERES
166        LAURENCE BULLOCK
167             WILL WILSON
168         KENNETH HOFFMAN
169             MENA HOPPER
170        OLYMPIA PFEIFFER
171        GROUCHO WILLIAMS
172           ALAN DREYFUSS
173          MICHAEL BENING
174         WILLIAM HACKMAN
175               JON CHASE
176           GENE MCKELLEN
177             LISA MONROE
178              ED GUINESS
179        JEFF SILVERSTONE
180          MATTHEW CARREY
181           DEBBIE AKROYD
182           RUSSELL CLOSE
183        HUMPHREY GARLAND
184          MICHAEL BOLGER
185         JULIA ZELLWEGER
186              RENEE BALL
187            ROCK DUKAKIS
188              CUBA BIRCH
189           AUDREY BAILEY
190         GREGORY GOODING
191             JOHN SUVARI
192             BURT TEMPLE
193             MERYL ALLEN
194       JAYNE SILVERSTONE
195             BELA WALKEN
196              REESE WEST
197             MARY KEITEL
198           JULIA FAWCETT
199            THORA TEMPLE
Name: complete_name, dtype: object

In [29]:
df_act['complete_name'].value_counts().head()

SUSAN DAVIS       2
EWAN GOODING      1
DARYL CRAWFORD    1
GRETA KEITEL      1
JANE JACKMAN      1
Name: complete_name, dtype: int64

In [30]:
#df_act[(df_act.complete_name.value_counts() > 1)]

In [31]:
df_act.last_update.value_counts()

2006-02-15 04:34:33    200
Name: last_update, dtype: int64

In [32]:
df_act.drop(['last_update'], axis=1, inplace = True)

In [33]:
df_act.head()

   actor_id first_name     last_name        complete_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

In [34]:
df_cat_ori = pd.read_csv(r'C:\Users\david\Proyectos\w3-database-project\data\category.csv')

In [35]:
df_cat_ori.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [36]:
df_cat=df_cat_ori.copy()

In [37]:
df_cat.shape

(16, 3)

In [38]:
df_cat_dim_orig=df_cat.shape

In [39]:
df_cat.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [40]:
df_cat.columns

Index(['category_id', 'name', 'last_update'], dtype='object')

In [41]:
df_cat.drop_duplicates().shape==df_cat.shape

True

In [42]:
df_cat.category_id.unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16],
      dtype=int64)

In [43]:
df_cat.name.unique()

array(['Action', 'Animation', 'Children', 'Classics', 'Comedy',
       'Documentary', 'Drama', 'Family', 'Foreign', 'Games', 'Horror',
       'Music', 'New', 'Sci-Fi', 'Sports', 'Travel'], dtype=object)

In [44]:
df_cat.name.value_counts()

Action         1
Animation      1
Children       1
Classics       1
Comedy         1
Documentary    1
Drama          1
Family         1
Foreign        1
Games          1
Horror         1
Music          1
New            1
Sci-Fi         1
Sports         1
Travel         1
Name: name, dtype: int64

In [45]:
df_cat.last_update.unique()

array(['2006-02-15 04:46:27'], dtype=object)

In [46]:
df_cat.drop(['last_update'], axis=1, inplace = True)

In [47]:
df_cat.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy